In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [56]:
df = pd.read_csv('train.csv')
df.head()

,User_ID,Product_ID,Gender,Age,Occupation,City_Category,Stay_In_Current_City_Years,Marital_Status,Product_Category_1,Product_Category_2,Product_Category_3,Purchase
0,1000001,P00069042,F,0-17,10,A,2,0,3,NaN,NaN,8370
1,1000001,P00248942,F,0-17,10,A,2,0,1,6.0,14.0,15200
2,1000001,P00087842,F,0-17,10,A,2,0,12,NaN,NaN,1422
3,1000001,P00085442,F,0-17,10,A,2,0,12,14.0,NaN,1057
4,1000002,P00285442,M,55+,16,C,4+,0,8,NaN,NaN,7969

In [57]:
df.describe(include='all')

,User_ID,Product_ID,Gender,Age,Occupation,City_Category,Stay_In_Current_City_Years,Marital_Status,Product_Category_1,Product_Category_2,Product_Category_3,Purchase
count,5.500680e+05,550068,550068,550068,550068.000000,550068,550068,550068.000000,550068.000000,376430.000000,166821.000000,550068.000000
unique,NaN,3631,2,7,NaN,3,5,NaN,NaN,NaN,NaN,NaN
top,NaN,P00265242,M,26-35,NaN,B,1,NaN,NaN,NaN,NaN,NaN
freq,NaN,1880,414259,219587,NaN,231173,193821,NaN,NaN,NaN,NaN,NaN
mean,1.003029e+06,NaN,NaN,NaN,8.076707,NaN,NaN,0.409653,5.404270,9.842329,12.668243,9263.968713
std,1.727592e+03,NaN,NaN,NaN,6.522660,NaN,NaN,0.491770,3.936211,5.086590,4.125338,5023.065394
min,1.000001e+06,NaN,NaN,NaN,0.000000,NaN,NaN,0.000000,1.000000,2.000000,3.000000,12.000000
25%,1.001516e+06,NaN,NaN,NaN,2.000000,NaN,NaN,0.000000,1.000000,5.000000,9.000000,5823.000000
50%,1.003077e+06,NaN,NaN,NaN,7.000000,NaN,NaN,0.000000,5.000000,9.000000,14.000000,8047.000000
75%,1.004478e+06,NaN,NaN,NaN,14.000000,NaN,NaN,1.000000,8.000000,15.000000,16.000000,12054.000000
max,1.006040e+06,NaN,NaN,NaN,20.000000,NaN,NaN,1.000000,20.000000,18.000000,18.000000,23961.000000

In [58]:
df.isnull().sum()

User_ID                            0
Product_ID                         0
Gender                             0
Age                                0
Occupation                         0
City_Category                      0
Stay_In_Current_City_Years         0
Marital_Status                     0
Product_Category_1                 0
Product_Category_2            173638
Product_Category_3            383247
Purchase                           0
dtype: int64

In [59]:
len(df.User_ID.value_counts())

5891

In [60]:
len(df.Product_ID.value_counts())

3631

In [61]:
len(df.Occupation.value_counts())

21

In [62]:
from scipy.stats import mode

In [63]:
len(df.Product_Category_1.value_counts())

20

In [64]:
df['Product_Category_2'] = df.Product_Category_2.fillna(999)

In [65]:
df['Product_Category_3'] = df.Product_Category_3.fillna(999)

In [66]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 550068 entries, 0 to 550067
Data columns (total 12 columns):
User_ID                       550068 non-null int64
Product_ID                    550068 non-null object
Gender                        550068 non-null object
Age                           550068 non-null object
Occupation                    550068 non-null int64
City_Category                 550068 non-null object
Stay_In_Current_City_Years    550068 non-null object
Marital_Status                550068 non-null int64
Product_Category_1            550068 non-null int64
Product_Category_2            550068 non-null float64
Product_Category_3            550068 non-null float64
Purchase                      550068 non-null int64
dtypes: float64(2), int64(5), object(5)
memory usage: 50.4+ MB

In [67]:
df['Product_ID'] = df.Product_ID.str[1:]

In [68]:
var = ['Gender','Age','Occupation','City_Category','Stay_In_Current_City_Years','Product_ID']

In [69]:
from sklearn.ensemble import AdaBoostClassifier
from sklearn.preprocessing import LabelEncoder
from sklearn.tree import DecisionTreeClassifier

from sklearn.model_selection import train_test_split
from sklearn import metrics

In [70]:
for label in var:
    df[label] = LabelEncoder().fit_transform(df[label])

In [71]:
df.head()

,User_ID,Product_ID,Gender,Age,Occupation,City_Category,Stay_In_Current_City_Years,Marital_Status,Product_Category_1,Product_Category_2,Product_Category_3,Purchase
0,1000001,672,0,0,10,0,2,0,3,999.0,999.0,8370
1,1000001,2376,0,0,10,0,2,0,1,6.0,14.0,15200
2,1000001,852,0,0,10,0,2,0,12,999.0,999.0,1422
3,1000001,828,0,0,10,0,2,0,12,14.0,999.0,1057
4,1000002,2734,1,6,16,2,4,0,8,999.0,999.0,7969

In [73]:
X = df.drop(['Purchase','User_ID'],axis = 1)
y = df['Purchase']

In [74]:
x_train,x_test,y_train,y_test = train_test_split(X,y,test_size = 0.3)

In [75]:
x_train.columns

Index(['Product_ID', 'Gender', 'Age', 'Occupation', 'City_Category',
       'Stay_In_Current_City_Years', 'Marital_Status', 'Product_Category_1',
       'Product_Category_2', 'Product_Category_3'],
      dtype='object')

In [76]:
x_train.to_csv('x_train.csv', header = True, index = False )

In [77]:
y_train.to_csv('y_train.csv', header = True, index = False )

In [43]:
#model = DecisionTreeClassifier(criterion = 'entropy',max_depth = 1)
#AdaBoost = AdaBoostClassifier(base_estimator = model, n_estimators = 200, learning_rate = 1)
#boostmodel = AdaBoost.fit(x_train,y_train)

In [78]:
from xgboost import XGBRegressor

In [79]:
xgb = XGBRegressor()
model = xgb.fit(x_train,y_train)

C:\Users\rohan\Anaconda3\envs\rohanenv\lib\site-packages\xgboost\core.py:587: FutureWarning: Series.base is deprecated and will be removed in a future version
  if getattr(data, 'base', None) is not None and \

[17:59:13] WARNING: src/objective/regression_obj.cu:152: reg:linear is now deprecated in favor of reg:squarederror.

In [80]:
model.score(x_train,y_train)

0.6618645915109973

In [81]:
predictions = model.predict(x_train)

In [82]:
from sklearn.metrics import mean_squared_error
from math import sqrt

rms = sqrt(mean_squared_error(y_train, predictions))

In [83]:
rms

2919.4127654560048

In [84]:
y_test_pred = model.predict(x_test)

In [85]:
rms2 = sqrt(mean_squared_error(y_test,y_test_pred))
rms2

2927.035236364795

In [86]:
test = pd.read_csv('test.csv')

In [87]:
test.isnull().sum()

User_ID                            0
Product_ID                         0
Gender                             0
Age                                0
Occupation                         0
City_Category                      0
Stay_In_Current_City_Years         0
Marital_Status                     0
Product_Category_1                 0
Product_Category_2             72344
Product_Category_3            162562
dtype: int64

In [88]:
def preprocessing_data(df):
    
    import pandas as pd
    import numpy as np
    
    df['Product_Category_2'] = df.Product_Category_2.fillna(999)
    df['Product_Category_3'] = df.Product_Category_3.fillna(999)
    
    df['Product_ID'] = df.Product_ID.str[1:]
    
    var = ['Gender','Age','Occupation','City_Category','Stay_In_Current_City_Years','Product_ID']
    
    from sklearn.preprocessing import LabelEncoder
    for label in var:
        df[label] = LabelEncoder().fit_transform(df[label])
        
    X_test= df.drop(['User_ID'],axis = 1)
    
    return X_test

In [89]:
test = pd.read_csv('test.csv')
test_var = preprocessing_data(test)

In [95]:
test_pred = model.predict(test_var)

In [97]:
test_pred = pd.DataFrame(test_pred)

In [98]:
submission = pd.DataFrame()

In [99]:
submission = test[['User_ID','Product_ID']]

In [100]:
submission['Purchase'] = test_pred

C:\Users\rohan\Anaconda3\envs\rohanenv\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  """Entry point for launching an IPython kernel.

In [103]:
submission.to_csv('Submission_File.csv', header = True, index = False)

In [104]:
test.head()

,User_ID,Product_ID,Gender,Age,Occupation,City_Category,Stay_In_Current_City_Years,Marital_Status,Product_Category_1,Product_Category_2,Product_Category_3
0,1000004,1144,1,4,7,1,2,1,1,11.0,999.0
1,1000009,994,1,2,17,2,0,0,3,5.0,999.0
2,1000010,2672,0,3,1,1,4,1,5,14.0,999.0
3,1000010,1299,0,3,1,1,4,1,4,9.0,999.0
4,1000011,519,0,2,1,2,1,0,4,5.0,12.0